:PROPERTIES:
:ID:       E3E30A4E-DC23-4811-8772-FC9E2749EDC6
:END:
#+title: My Org Notes

* This is an example headline                                      :tag:tag2:
:PROPERTIES:
:ID:       8335CF4B-A5ED-4E10-8E3A-3A2A48E2AB76
:END:

#+begin_src emacs-lisp
(defun org-tidy ()
  "Tidy."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward org-property-drawer-re nil t)
        (let* ((beg (match-beginning 0))
               (end (1+ (match-end 0))))
          (org-tidy-hide beg end)))))
#+end_src

s

#+begin_src emacs-lisp :results raw
(org-untidy)
(org-tidy-src)
#+end_src

#+RESULTS:
((((237 248) . #<overlay from 237 to 248 in test.org>) ((531 540) . #<overlay from 531 to 540 in test.org>)) (((545 556) . #<overlay from 545 to 556 in test.org>) ((609 618) . #<overlay from 609 to 618 in test.org>) ((237 248) . #<overlay from 237 to 248 in test.org>) ((531 540) . #<overlay from 531 to 540 in test.org>)))
((((237 248) . #<overlay from 237 to 248 in test.org>) ((531 540) . #<overlay from 531 to 540 in test.org>)) (((545 556) . #<overlay from 545 to 556 in test.org>) ((609 618) . #<overlay from 609 to 618 in test.org>) ((237 248) . #<overlay from 237 to 248 in test.org>) ((531 540) . #<overlay from 531 to 540 in test.org>)))
((((237 249) . #<overlay from 237 to 249 in test.org>) ((531 540) . #<overlay from 531 to 540 in test.org>)) (((545 557) . #<overlay from 545 to 557 in test.org>) ((609 618) . #<overlay from 609 to 618 in test.org>) ((237 249) . #<overlay from 237 to 249 in test.org>) ((531 540) . #<overlay from 531 to 540 in test.org>)))


Lorem ipsum dolor sit amet, consectetur adipiscing elit.

Maecenas vel arcu tempor, luctus mauris nec, aliquet est. Aliquam tincidunt magna nisi. In eget tempor ligula. Suspendisse interdum justo velit, in rutrum magna porttitor pellentesque. Sed tempus blandit magna, sed iaculis neque. Donec est mi, placerat quis tincidunt ac, vulputate ac libero. Maecenas vitae felis accumsan, varius nibh ac, volutpat leo. Etiam a nibh fermentum magna tempor pellentesque ac non orci.
